app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "admin", "remember_token", "login", "email") VALUES('', '0b71c850406f37d33b315f01a084c3bcfe6acdfa', '2012-02-03 23:19:55', '07a1995208e01b27a40d96108b83d743935abee0', NULL, '2012-02-03 23:19:55', 'f', NULL, 'zarinficklin@gmail.com', 'zarinficklin@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save